ch6/ch6-problems.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-07 Fri 13:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chapter 6 problems</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="pedh" />
<link rel="stylesheet" type="text/css" href="/css/org-info.css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/CLRS-Solutions"> UP </a>
 |
 <a accesskey="H" href="/CLRS-Solutions"> HOME </a>
</div><div id="content">
<h1 class="title">Chapter 6 problems</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0a76636">ch6-problems</a>
<ul>
<li><a href="#org59bb147">6-1</a></li>
<li><a href="#org548bbad">6-2</a></li>
<li><a href="#orgfb31dc0">6-3</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org0a76636" class="outline-2">
<h2 id="org0a76636">ch6-problems</h2>
<div class="outline-text-2" id="text-org0a76636">
</div>
<div id="outline-container-org59bb147" class="outline-3">
<h3 id="org59bb147">6-1</h3>
<div class="outline-text-3" id="text-org59bb147">
<ul class="org-ul">
<li><p>
<b>a.</b>
</p>

<p>
No, consider \(A = \langle 1, 2, 3 \rangle\), BUILD-MAX-HEAP(A) returns
\(\langle 3, 2, 1 \rangle\), and BUILD-MAX-HEAP'(A) returns
\(\langle 3, 1, 2 \rangle\).
</p></li>
<li><p>
<b>b.</b>
</p>

<p>
The worst case appears when the input A is already sorted, the running time
of BUILD-MAX-HEAP' is
</p>
\begin{align*}
T(n)
&=\sum_{i=2}^{n}\Theta(\lfloor\lg i\rfloor)\\
&=\Theta(n\lg n)
\end{align*}</li>
</ul>
</div>
</div>
<div id="outline-container-org548bbad" class="outline-3">
<h3 id="org548bbad">6-2</h3>
<div class="outline-text-3" id="text-org548bbad">
<ul class="org-ul">
<li><p>
<b>a.</b>
</p>

<p>
We could define PARENT and CHILD as below to represent a d-ary heap.
</p>
<pre class="example">
PARENT(i, d)
    return (i + d - 2) // d
</pre>
<pre class="example">
CHILD(i, j, d)
    // the jth child of node i
    return (i - 1) * d + 1 + j
</pre></li>
<li><p>
<b>b.</b>
</p>

<p>
The height of a d-ary heap of n elements is
\(\lfloor\log_{d}((n - 1)(d - 1) + 1)\rfloor\).
</p></li>
<li><p>
<b>c.</b>
</p>

<p>
The running time is \(\Theta(d\log_d n)\).
</p>
<pre class="example">
EXTRACT-MAX(A)
    if A.heap-size &lt; 1
	error "heap underflow"
    max = A[1]
    A[1] = A[A.heap-size]
    A.heap-size = A.heap-size - 1
    MAX-HEAPIFY(A, 1)
    return max
</pre>
<pre class="example">
MAX-HEAPIFY(A, i)
    largest = i
    for j = 1 to A.d
	child = CHILD(i, j, d)
	if child &gt; A.heap-size
	    break
	if A[child] &gt; A[largest]
	    largest = child
    if largest != i
	exchange A[i] with A[largest]
	MAX-HEAPIFY(A, largest)
</pre></li>
<li><p>
<b>d.</b>
</p>

<p>
The running time is \(O(\log_d n)\).
</p>
<pre class="example">
INSERT(A, key)
    A.heap-size = A.heap-size + 1
    A[A.heap-size] = -\infty
    INCREASE-KEY(A, A.heap-size, key)
</pre></li>
<li><p>
<b>e.</b>
</p>

<p>
The running time is \(O(\log_d n)\).
</p>
<pre class="example">
INCREASE-KEY(A, i, key)
    if key &lt; A[i]
	error "new key is smaller than current key"
    A[i] = key
    while i &gt; 1 and A[PARENT(i)] &lt; A[i]
	exchange A[i] with A[PARENT(i)]
	i = PARENT(i)
</pre></li>
</ul>
</div>
</div>
<div id="outline-container-orgfb31dc0" class="outline-3">
<h3 id="orgfb31dc0">6-3</h3>
<div class="outline-text-3" id="text-orgfb31dc0">
<ul class="org-ul">
<li><p>
<b>a.</b>
</p>

<p>
The Young tableau is as below
</p>
\begin{matrix}
2 & 3 & 4 & 5\\
8 & 9 & 12 & 14\\
16 & \infty & \infty & \infty\\
\infty & \infty & \infty & \infty
\end{matrix}</li>
<li><p>
<b>b.</b>
</p>

<p>
\(Y[1, 1]\) is the smallest element of \(Y\), and \(Y[1, 1] = \infty\),
so Y is empty.
</p>

<p>
\(Y[m, n]\) is the largest element of \(Y\), and \(Y[m, n] < \infty\),
so Y is full.
</p></li>
<li><p>
<b>c.</b>
</p>

<pre class="example">
EXTRACT-MIN(Y)
    min = Y[1, 1]
    Y[1, 1] = \infty
    YOUNG-TABLEAUFY(Y, 1, 1)
    return min
</pre>
<pre class="example">
YOUNG-TABLEAUFY(Y, r, c)
    right = (r, c + 1)
    below = (r + 1, c)
    if right &lt;= (Y.m, Y.n) and Y[right] &lt; Y[r, c]
	smallest = right
    else smallest = (r, c)
    if below &lt;= (Y.m, Y.n) and Y[below] &lt; Y[smallest]
	smallest = below
    if smallest != (r, c)
	exchange Y[r, c] with Y[smallest]
	YOUNG-TABLEAUFY(Y, smallest)
</pre>
<p>
The running time is \(T(p) = T(p - 1) + O(1) = O(m + n)\).
</p></li>
<li><p>
<b>d.</b>
</p>

<pre class="example">
YOUNG-TABLEAU-INSERT(Y, key)
    if Y[Y.m, Y.n] &lt; \infty
	error "the Young tableau is already full"
    Y[Y.m, Y.n] = key
    i = Y.m
    j = Y.n
    while i &gt;= 1 and j &gt;= 1
	left = (i, j - 1)
	above = (i - 1, j)
	if left &gt;= (1, 1) and Y[left] &gt; Y[i, j]
	    largest = left
	else largest = (i, j)
	if above &gt;= (1, 1) and Y[above] &lt; Y[largest]
	    largest = above
	if largest != (i, j)
	    exchange Y[i, j] with Y[largest]
	    (i, j) = largest
	else return
</pre></li>
<li><p>
<b>e.</b>
</p>

<pre class="example">
YOUNG-TABLEAU-SORT(A, n)
    let Y[n, n] to be new Young tableau
    for i = 1 to n * n
	YOUNG-TABLEAU-INSERT(Y, A[i])
    for j = 1 to n * n
	A[j] = EXTRACT-MIN(Y)
</pre>
<p>
First we create a new Young tableau Y[n, n], it costs \(O(n^2)\) running
time.
</p>

<p>
Then we insert the \(n^2\) elements into Y, it costs \(O(n^3)\)
running time.
</p>

<p>
At last we extract the \(n^2\) elements from Y, it costs
\(O(n^3)\) running time, the total running time is \(O(n^3)\).
</p></li>
<li><p>
<b>f.</b>
</p>

<pre class="example">
YOUNG-TABLEAU-SEARCH(Y, key)
    i = Y.m
    j = 1
    while i &gt;= 1 and j &lt;= Y.n
	if key == Y[i, j]
	    return (i, j)
	if key &lt; Y[i, j]
	    i = i - 1
	else j = j + 1
    return False
</pre></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: pedh</p>
<p class="date">Created: 2020-02-07 Fri 13:25</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
